{
	"version": "https://jsonfeed.org/version/1",
	"title": "settee",
	"icon": "https://micro.blog/settee/avatar.jpg",
	"home_page_url": "https://sett.ee/",
	"feed_url": "https://sett.ee/feed.json",
	"items": [
		
			{
				"id": "http://humble.micro.blog/2025/08/13/its-a-meerkat-wedneday.html",
				"title": "it's a meerkat wednesday",
				"content_html": "<p>gotta look back and forward a few days, what you been doing, what you not achieved yet and what&rsquo;s the near future look like.</p>\n<p>right now, my life for the next few years looks BUSY.</p>\n<p>life demands, i feel the work to get here was just the start, i&rsquo;m certainly feeling that what we achieved so far was a mammoth task for both of us especially as we are both very bad at SLOW and PAPER.</p>\n<p>but we made it through and i&rsquo;m thankful, even playing field, everyone get&rsquo;s a chance.</p>\n<p>the world is literally a connected playground, i can feel the buzz (maybe that&rsquo;s just the generators running diesel keeping the ai cloud going)</p>\n<p>i&rsquo;m struggling to focus on just learning in the old way just to acquire a pay range at a job.</p>\n<p>doesn&rsquo;t feel right to work inside of a company with the limiting factors of what software provider they use.</p>\n<p>unless something dynamic comes across my lap or realm of interest i think building out some long term ideas is the way forward or just optimizing where their is gaps and inefficiency.</p>\n<p>there is so much room for creative thinking and thinking fast and delivering tools that are life assistive.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "gotta look back and forward a few days, what you been doing, what you not achieved yet and what's the near future look like.  \n\nright now, my life for the next few years looks BUSY.\n\nlife demands, i feel the work to get here was just the start, i'm certainly feeling that what we achieved so far was a mammoth task for both of us especially as we are both very bad at SLOW and PAPER.\n\nbut we made it through and i'm thankful, even playing field, everyone get's a chance.\n\nthe world is literally a connected playground, i can feel the buzz (maybe that's just the generators running diesel keeping the ai cloud going)\n\ni'm struggling to focus on just learning in the old way just to acquire a pay range at a job.\n\ndoesn't feel right to work inside of a company with the limiting factors of what software provider they use.\n\nunless something dynamic comes across my lap or realm of interest i think building out some long term ideas is the way forward or just optimizing where their is gaps and inefficiency. \n\nthere is so much room for creative thinking and thinking fast and delivering tools that are life assistive.\n\n<img src=\"uploads/2025/meerkat-wed-aug13.webp\">\n",
				"date_published": "2025-08-13T09:17:00-04:00",
				"url": "https://sett.ee/2025/08/13/its-a-meerkat-wedneday.html",
				"tags": ["meerkat-wed"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/13/httpswwwalltextnyc-is-a-constant-reminder.html",
				
				"content_html": "<p><a href=\"https://www.alltext.nyc\">www.alltext.nyc</a> is a constant reminder of the amount of data we have out there in the world, the engines of classification that&rsquo;s at work second to second, minute to hour around the world as i stare outside of a 90f day. are we cooked? most cooked, great little project thou.</p>\n",
				"content_text": "[www.alltext.nyc](https://www.alltext.nyc) is a constant reminder of the amount of data we have out there in the world, the engines of classification that's at work second to second, minute to hour around the world as i stare outside of a 90f day. are we cooked? most cooked, great little project thou.\n",
				"date_published": "2025-08-13T08:57:45-04:00",
				"url": "https://sett.ee/2025/08/13/httpswwwalltextnyc-is-a-constant-reminder.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/13/occasionally-you-need-little-sites.html",
				
				"content_html": "<p>occasionally you need little sites to break up the day, i suggest <a href=\"https://fingerjigger.com\">fingerjigger.com</a> that i just found, i love the breakdown of the stats and the animations are great, my typing speed has gone bad in recent years, subwolf would have crushed this. miss you buddy. peace and love.</p>\n",
				"content_text": "occasionally you need little sites to break up the day, i suggest [fingerjigger.com](https://fingerjigger.com) that i just found, i love the breakdown of the stats and the animations are great, my typing speed has gone bad in recent years, subwolf would have crushed this. miss you buddy. peace and love.\n",
				"date_published": "2025-08-13T08:55:10-04:00",
				"url": "https://sett.ee/2025/08/13/occasionally-you-need-little-sites.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/13/get-rest-get-up-water.html",
				
				"content_html": "<p>get rest, get up, water, exercise, water, kiss wife, breakfast and back at the computer, rinse and repeat until you have all your eggs in a row as they say. watched doc play the mafia old country last night, much fun, now feeling very rested so straight into the day. meerkat wednesday people!</p>\n",
				"content_text": "get rest, get up, water, exercise, water, kiss wife, breakfast and back at the computer, rinse and repeat until you have all your eggs in a row as they say. watched doc play the mafia old country last night, much fun, now feeling very rested so straight into the day. meerkat wednesday people!\n",
				"date_published": "2025-08-13T08:16:28-04:00",
				"url": "https://sett.ee/2025/08/13/get-rest-get-up-water.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/12/really-great-tool-httpsntfysh-for.html",
				
				"content_html": "<p>really great tool, <a href=\"https://ntfy.sh\">ntfy.sh</a> for sending notifications from scripts/apps and it&rsquo;s really straight forward to setup and makes a lot of sense, had it up and running in less than ten minutes, now i want to have notifications for everything! always the way, tinkering attitude!</p>\n",
				"content_text": "really great tool, [ntfy.sh](https://ntfy.sh) for sending notifications from scripts/apps and it's really straight forward to setup and makes a lot of sense, had it up and running in less than ten minutes, now i want to have notifications for everything! always the way, tinkering attitude!\n",
				"date_published": "2025-08-12T14:38:24-04:00",
				"url": "https://sett.ee/2025/08/12/really-great-tool-httpsntfysh-for.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/12/retroactively-virtual.html",
				"title": "retro-actively virtual",
				"content_html": "<p>if you&rsquo;ve been looking at ai and coming to the conclusion it&rsquo;s all just slop take a little time out, grab a hot beverage and just watch what people are doing about engineering their own life legacy into their uniquely custom safe spaces.</p>\n<style>\n.video-wrapper {\n  position: relative;\n  padding-bottom: 56.25%;\n  height: 0;\n  max-width: 100%;\n  overflow: hidden;\n  background-color: #000;\n}\n\n.video-thumbnail {\n  position: absolute;\n  width: 100%;\n  height: 100%;\n  object-fit: contain;\n  background-color: #000;\n  cursor: pointer;\n  z-index: 1;\n}\n\n.video-overlay {\n  position: absolute;\n  bottom: 0;\n  left: 0;\n  width: 100%;\n  background: rgba(0, 0, 0, 0.85);\n  color: white;\n  text-align: center;\n  font-size: 0.85em;\n  padding: 0.5em 1em;\n  z-index: 2;\n  pointer-events: none;\n}\n\n.video-play-button {\n  position: absolute;\n  top: 50%;\n  left: 50%;\n  transform: translate(-50%, -50%);\n  width: 68px;\n  height: 48px;\n  background-color: rgba(255, 0, 0, 0.8);\n  border-radius: 12px;\n  z-index: 3;\n  pointer-events: none;\n}\n\n.video-play-button::before {\n  content: '';\n  position: absolute;\n  left: 26px;\n  top: 14px;\n  width: 0;\n  height: 0;\n  border-left: 18px solid white;\n  border-top: 12px solid transparent;\n  border-bottom: 12px solid transparent;\n}\n\n.video-wrapper iframe {\n  position: absolute;\n  top: 0;\n  left: 0;\n  width: 100%;\n  height: 100%;\n  border: none;\n  z-index: 4;\n}\n</style>\n\n<div class=\"video-wrapper youtube-spaced\" data-video-id=\"TQhv6Wol6Ns\">\n  <img\n    class=\"video-thumbnail\"\n    src=\"https://img.youtube.com/vi/TQhv6Wol6Ns/maxresdefault.jpg\"\n    onerror=\"this.onerror=null; this.src='https://img.youtube.com/vi/TQhv6Wol6Ns/0.jpg';\"\n    alt=\"YouTube Thumbnail\">\n    \n  \n\n  <div class=\"video-play-button\"></div>\n</div>\n\n<script>\ndocument.querySelectorAll('.video-wrapper').forEach(wrapper => {\n  if (wrapper.dataset.listenersAdded === 'true') {\n    return;\n  }\n  wrapper.dataset.listenersAdded = 'true';\n\n  const videoId = wrapper.dataset.videoId;\n  const overlay = wrapper.querySelector('.video-overlay');\n  const thumbnail = wrapper.querySelector('.video-thumbnail');\n\n  function loadVideo() {\n    wrapper.innerHTML = `<iframe src=\"https://www.youtube-nocookie.com/embed/${videoId}?autoplay=1&mute=1\" allowfullscreen></iframe>`;\n  }\n\n  wrapper.addEventListener('click', loadVideo);\n  overlay?.addEventListener('click', loadVideo);\n  thumbnail?.addEventListener('click', loadVideo);\n});\n</script>\n\n<p>custom unique places and spaces, open source, everyone can get onboard, remix, reimagine, imagination firing on all verses all at once, a pseudo imaging of a previous (safe space?) while growing up, a faux operating system inside a browser running on an operating system, the lines of &ldquo;where i am on the web&rdquo; are blurring, ai coding an pseudo operating system inside of a browser is just like virtualized dreaming.</p>\n<p>i feel like those creatives that have wanted to code but got bogged down with the details will now have the freedom to imagine and pull on their experiences to combine things like a fine chef &ndash; in the moment, in real time, location based, mood based, physical input based, inspired by having a conversation with an ai to explore the edges and to build connective tissue between information and experiences of the creator and the viewer.</p>\n<p>the lines blur for me there.</p>\n<p>i&rsquo;m reminded when i see videos like these about how far we have come, how far technology has moved past the limitations and accelerated into this new frontier where is feels like anything is possible and we have the phone book to the connected planet at our finger tips, no longer is it i &ldquo;might know a person&rdquo; &ndash; i don&rsquo;t even have to have any relationship to that person anymore and i can query the knowledge in the blink of an eye.</p>\n<p>i feel it&rsquo;s important almost now to forget everything i knew in many regards, every gripe, every frustration, every story of how it used to be so that the new frontier can get better value out of how i perceive these new tools. the ethics and morals remain but the frustrations and the rejection feeling of not knowing how it could work for me and my teenager brain need to be rewritten, the technology playing field is flattened.</p>\n",
				"content_text": "if you've been looking at ai and coming to the conclusion it's all just slop take a little time out, grab a hot beverage and just watch what people are doing about engineering their own life legacy into their uniquely custom safe spaces.\n\n{{< yt \"TQhv6Wol6Ns\" >}}\n\n\ncustom unique places and spaces, open source, everyone can get onboard, remix, reimagine, imagination firing on all verses all at once, a pseudo imaging of a previous (safe space?) while growing up, a faux operating system inside a browser running on an operating system, the lines of \"where i am on the web\" are blurring, ai coding an pseudo operating system inside of a browser is just like virtualized dreaming.\n\ni feel like those creatives that have wanted to code but got bogged down with the details will now have the freedom to imagine and pull on their experiences to combine things like a fine chef -- in the moment, in real time, location based, mood based, physical input based, inspired by having a conversation with an ai to explore the edges and to build connective tissue between information and experiences of the creator and the viewer. \n\nthe lines blur for me there.\n\ni'm reminded when i see videos like these about how far we have come, how far technology has moved past the limitations and accelerated into this new frontier where is feels like anything is possible and we have the phone book to the connected planet at our finger tips, no longer is it i \"might know a person\" -- i don't even have to have any relationship to that person anymore and i can query the knowledge in the blink of an eye.\n\ni feel it's important almost now to forget everything i knew in many regards, every gripe, every frustration, every story of how it used to be so that the new frontier can get better value out of how i perceive these new tools. the ethics and morals remain but the frustrations and the rejection feeling of not knowing how it could work for me and my teenager brain need to be rewritten, the technology playing field is flattened.\n\n",
				"date_published": "2025-08-12T11:49:00-04:00",
				"url": "https://sett.ee/2025/08/12/retroactively-virtual.html",
				"tags": ["sloptastic"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/12/one-of-the-things-i.html",
				
				"content_html": "<p>one of the things i enjoy most about getting to the machine is seeing what new models replicate has added to the mix. it&rsquo;s like someone else is doing all the curating and it feels like getting time back and once i&rsquo;ve built my cli/app tool for querying replicate it&rsquo;s gonna be easy to add the new ones</p>\n",
				"content_text": "one of the things i enjoy most about getting to the machine is seeing what new models replicate has added to the mix. it's like someone else is doing all the curating and it feels like getting time back and once i've built my cli/app tool for querying replicate it's gonna be easy to add the new ones\n",
				"date_published": "2025-08-12T11:26:10-04:00",
				"url": "https://sett.ee/2025/08/12/one-of-the-things-i.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/12/one-of-the-things-im.html",
				
				"content_html": "<p>one of the things i&rsquo;m really interested in doing is setting up a very fast local network attached ai rendering farm for all things audio, images and video. for now i&rsquo;m playing with things like <a href=\"https://jan.ai\">jan.ai</a> to see what kind of token performance i can get, will maybe go llmstudio.</p>\n",
				"content_text": "one of the things i'm really interested in doing is setting up a very fast local network attached ai rendering farm for all things audio, images and video. for now i'm playing with things like [jan.ai](https://jan.ai) to see what kind of token performance i can get, will maybe go llmstudio.\n",
				"date_published": "2025-08-12T11:01:51-04:00",
				"url": "https://sett.ee/2025/08/12/one-of-the-things-im.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/11/is-a-fast-day-or.html",
				
				"content_html": "<p>is a fast day or a slow day, is there any such thing as a slow day anymore? speed run out this morning to grab eggs and coffee and post, back made a protein cheesecake, tested new audio interface for phone and IEM&rsquo;s. fantastic, also got a new usb-c mic setup to try now phone upgraded #winning</p>\n",
				"content_text": "is a fast day or a slow day, is there any such thing as a slow day anymore? speed run out this morning to grab eggs and coffee and post, back made a protein cheesecake, tested new audio interface for phone and IEM's. fantastic, also got a new usb-c mic setup to try now phone upgraded #winning\n",
				"date_published": "2025-08-11T09:52:12-04:00",
				"url": "https://sett.ee/2025/08/11/is-a-fast-day-or.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/10/faux-steamer-trunks.html",
				"title": "faux steamer trunks",
				"content_html": "<p>6:23am, been awake since 6am I seem to wake when the sunrises recently which isn’t a bad thing the rest of my sleep is good.</p>\n<p>took this shot the other day of this incredibly neat and integrated work station in a store in the expensive creams and lotions section</p>\n<p>I have a thing for compact, neat, ready to go workstations and old timey steamer trunks crossovers.</p>\n<p>I realise this is not a steamer trunk but it gave me vibes. from on the ground events to moving house or taking equipment on location I love the idea of opening and your on.</p>\n<p>hopefully one day I get to build out that vision, kitted out, wheels and everything. bit like that on location audio sound carts you see but a step up from that.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "6:23am, been awake since 6am I seem to wake when the sunrises recently which isn’t a bad thing the rest of my sleep is good.\n\ntook this shot the other day of this incredibly neat and integrated work station in a store in the expensive creams and lotions section \n\nI have a thing for compact, neat, ready to go workstations and old timey steamer trunks crossovers. \n\nI realise this is not a steamer trunk but it gave me vibes. from on the ground events to moving house or taking equipment on location I love the idea of opening and your on. \n\nhopefully one day I get to build out that vision, kitted out, wheels and everything. bit like that on location audio sound carts you see but a step up from that.\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/a5c2c9a579.webp\">\n",
				"date_published": "2025-08-10T06:29:32-04:00",
				"url": "https://sett.ee/2025/08/10/faux-steamer-trunks.html",
				"tags": ["observations"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/just-built-a-little-tool.html",
				
				"content_html": "<p>just built a little tool to check .json files of a mapping service using ai and it built me the whole script to run on one of my 24/7 cloud servers and then sends me stuff via pushbullet when things trigger, if there is one thing about living in technology, it&rsquo;s bending data to make life better.</p>\n",
				"content_text": "just built a little tool to check .json files of a mapping service using ai and it built me the whole script to run on one of my 24/7 cloud servers and then sends me stuff via pushbullet when things trigger, if there is one thing about living in technology, it's bending data to make life better.\n",
				"date_published": "2025-08-08T14:05:53-04:00",
				"url": "https://sett.ee/2025/08/08/just-built-a-little-tool.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/first-time-ive-ever-heard.html",
				
				"content_html": "<p>first time i&rsquo;ve ever heard of WHIP (WebRTC-HTTP Ingestion Protocol) instead of RTMP the world has certainly come a long way in terms of streaming protocols and the software/platforms that support them, it&rsquo;s like landing on a new planet, star trek style. ingesting, recalibrating.</p>\n",
				"content_text": "first time i've ever heard of WHIP (WebRTC-HTTP Ingestion Protocol) instead of RTMP the world has certainly come a long way in terms of streaming protocols and the software/platforms that support them, it's like landing on a new planet, star trek style. ingesting, recalibrating.\n",
				"date_published": "2025-08-08T13:29:23-04:00",
				"url": "https://sett.ee/2025/08/08/first-time-ive-ever-heard.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/i-wish-microblog-had-a.html",
				
				"content_html": "<p>i wish micro.blog had a system wide popup modal like when you are using search tools like alfred where you could just like hit a series of hot keys and just like blast your message out and be done, the current method is &ldquo;ok&rdquo; but i want it system wide ideally.</p>\n",
				"content_text": "i wish micro.blog had a system wide popup modal like when you are using search tools like alfred where you could just like hit a series of hot keys and just like blast your message out and be done, the current method is \"ok\" but i want it system wide ideally.\n",
				"date_published": "2025-08-08T11:24:51-04:00",
				"url": "https://sett.ee/2025/08/08/i-wish-microblog-had-a.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/if-you-are-using-microblog.html",
				
				"content_html": "<p>if you are using micro.blog i suggest using .webp images for small file size for speedy loading, maybe you can do this auto with hugo i&rsquo;m not sure but i do it locally with <a href=\"https://lowtechguys.com/clop\">lowtechguys.com/clop</a> and it&rsquo;s only $15 for a lifetime license! so clutch, dropzones, watch folders. get yo optimized!</p>\n",
				"content_text": "if you are using micro.blog i suggest using .webp images for small file size for speedy loading, maybe you can do this auto with hugo i'm not sure but i do it locally with [lowtechguys.com/clop](https://lowtechguys.com/clop) and it's only $15 for a lifetime license! so clutch, dropzones, watch folders. get yo optimized!\n",
				"date_published": "2025-08-08T11:19:33-04:00",
				"url": "https://sett.ee/2025/08/08/if-you-are-using-microblog.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/i-wonder-how-many-people.html",
				
				"content_html": "<p>i wonder how many people have been activated by using ai? like the dreams and creatives that could not code but could plug in cables in their minds like old telephone exchanges? it&rsquo;s a new era, everyday seems like a new golden age. is this a new era of distributed abundance or self destruction?</p>\n",
				"content_text": "i wonder how many people have been activated by using ai? like the dreams and creatives that could not code but could plug in cables in their minds like old telephone exchanges? it's a new era, everyday seems like a new golden age. is this a new era of distributed abundance or self destruction?\n",
				"date_published": "2025-08-08T11:17:42-04:00",
				"url": "https://sett.ee/2025/08/08/i-wonder-how-many-people.html"
			},
			{
				"id": "http://humble.micro.blog/2025/08/08/its-friday-people.html",
				"title": "it's friday people.",
				"content_html": "<p>long week, felt that way.</p>\n<p>still waiting, still in holding position.</p>\n<p>there is nothing worse than having to wait for something for someone that just wants to go.</p>\n<p>this is a different kind of slow thou, it&rsquo;s just slow to access the finances so i can start deploying the things around me that make you feel like your established in your base.</p>\n<p>in my mind this weekend i&rsquo;m going rollerskating and i have all my protective wear on.</p>\n<p>i know it&rsquo;s just a waiting game but i feel like i&rsquo;m operating on impulse power right now, for the last year even, i&rsquo;ve been learning tons about ai but it&rsquo;s certainly the time to execute and build.</p>\n<p>i want my life on autopilot so i have more time for content creation and videoblogging again.</p>\n<p>currently playing around with clop which is a great tool for compressing images and video and it&rsquo;s cheap, i tried a bunch of others but they had real trouble with .mkv files.</p>\n<p>been finding a bunch of communities and lo-fi platforms that are exciting me that we are moving away from web2 and into web3 &ndash; bluesky and it&rsquo;s AT protocol are kind of making me realise how much more freedom we have and things like micro.blog allow me to cross post and continue conversations across the web.</p>\n<p>the near future of social media is bright.</p>\n<p>hope you have an awesome weekend!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "long week, felt that way.\n\nstill waiting, still in holding position.\n\nthere is nothing worse than having to wait for something for someone that just wants to go.\n\nthis is a different kind of slow thou, it's just slow to access the finances so i can start deploying the things around me that make you feel like your established in your base.\n\nin my mind this weekend i'm going rollerskating and i have all my protective wear on.\n\ni know it's just a waiting game but i feel like i'm operating on impulse power right now, for the last year even, i've been learning tons about ai but it's certainly the time to execute and build.\n\ni want my life on autopilot so i have more time for content creation and videoblogging again.\n\ncurrently playing around with clop which is a great tool for compressing images and video and it's cheap, i tried a bunch of others but they had real trouble with .mkv files.\n\nbeen finding a bunch of communities and lo-fi platforms that are exciting me that we are moving away from web2 and into web3 -- bluesky and it's AT protocol are kind of making me realise how much more freedom we have and things like micro.blog allow me to cross post and continue conversations across the web.\n\nthe near future of social media is bright.\n\nhope you have an awesome weekend!\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/8b3e25886f.webp\">\n",
				"date_published": "2025-08-08T10:40:11-04:00",
				"url": "https://sett.ee/2025/08/08/its-friday-people.html",
				"tags": ["observations"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/06/is-the-air-clean-at.html",
				"title": "is the air clean at least?",
				"content_html": "<p>Another meerkat Wednesday rolls into view.</p>\n<p>I wonder if that&rsquo;s something I&rsquo;d get to do in the future. I wonder if weeks are even talked about; maybe it&rsquo;s just a number now, a time slice, a countdown between the light and dark and the next meteor shower.</p>\n<p>Perhaps Swatch came racing back to the front and deployed their swatch time in some futuristic quantum attempt to be the provider of all-time tracking across the known multiverse.</p>\n<p>just writing in the hope that some of my current self makes it out there to my future self or maybe that can influence me back if we have time patterns that both go forward and back and can be a relay station to ever generational nexus ribbon of lives we touched.</p>\n<p>the air quality outside is bad today, well not bad, but orange, not good, wildfires you see, feeling very matrix skies are darkened by the very machines that made this image probably. the rub of creativity is the cost to the unseen i guess always.</p>\n<p>vibes are matched at the moment, down vibes, wish they vibes were unmatched but they match the usual pattern(s) of a current downward trend.  trying to focus on my mental health, getting some advice hopefully there, exercise and sleep is the order of the day currently.</p>\n<p>i have no doubt i&rsquo;ll be having a brown bag round of interactions relatively soon.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Another meerkat Wednesday rolls into view.\n\nI wonder if that's something I'd get to do in the future. I wonder if weeks are even talked about; maybe it's just a number now, a time slice, a countdown between the light and dark and the next meteor shower. \n\nPerhaps Swatch came racing back to the front and deployed their swatch time in some futuristic quantum attempt to be the provider of all-time tracking across the known multiverse.\n\njust writing in the hope that some of my current self makes it out there to my future self or maybe that can influence me back if we have time patterns that both go forward and back and can be a relay station to ever generational nexus ribbon of lives we touched.\n\nthe air quality outside is bad today, well not bad, but orange, not good, wildfires you see, feeling very matrix skies are darkened by the very machines that made this image probably. the rub of creativity is the cost to the unseen i guess always.\n\nvibes are matched at the moment, down vibes, wish they vibes were unmatched but they match the usual pattern(s) of a current downward trend.  trying to focus on my mental health, getting some advice hopefully there, exercise and sleep is the order of the day currently.\n\ni have no doubt i'll be having a brown bag round of interactions relatively soon.\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/humble-cafe-meerkat-wed-enhanced.webp\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-08-06T11:54:31-04:00",
				"url": "https://sett.ee/2025/08/06/is-the-air-clean-at.html",
				"tags": ["sloptastic"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/02/brand-new-eyes.html",
				"title": "brand new eyes",
				"content_html": "<p>one of the things that really stands out to me from moving a different country is the small things, the bugs you’ve never seen, the measuring in feet and not metres. It’s a reminder that you don’t know everything and to always be in learning mode.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "one of the things that really stands out to me from moving a different country is the small things, the bugs you’ve never seen, the measuring in feet and not metres. It’s a reminder that you don’t know everything and to always be in learning mode.\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/753cb3470c.jpg\" width=\"600\" height=\"419\" alt=\"\">\n",
				"date_published": "2025-08-02T12:55:46-04:00",
				"url": "https://sett.ee/2025/08/02/brand-new-eyes.html",
				"tags": ["observations","whatisdat"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/01/apple-laser-on-kpop.html",
				"title": "apple laser on kpop",
				"content_html": "<p>apple has all the data all the time.</p>\n<style>\n.video-wrapper {\n  position: relative;\n  padding-bottom: 56.25%;\n  height: 0;\n  max-width: 100%;\n  overflow: hidden;\n  background-color: #000;\n}\n\n.video-thumbnail {\n  position: absolute;\n  width: 100%;\n  height: 100%;\n  object-fit: contain;\n  background-color: #000;\n  cursor: pointer;\n  z-index: 1;\n}\n\n.video-overlay {\n  position: absolute;\n  bottom: 0;\n  left: 0;\n  width: 100%;\n  background: rgba(0, 0, 0, 0.85);\n  color: white;\n  text-align: center;\n  font-size: 0.85em;\n  padding: 0.5em 1em;\n  z-index: 2;\n  pointer-events: none;\n}\n\n.video-play-button {\n  position: absolute;\n  top: 50%;\n  left: 50%;\n  transform: translate(-50%, -50%);\n  width: 68px;\n  height: 48px;\n  background-color: rgba(255, 0, 0, 0.8);\n  border-radius: 12px;\n  z-index: 3;\n  pointer-events: none;\n}\n\n.video-play-button::before {\n  content: '';\n  position: absolute;\n  left: 26px;\n  top: 14px;\n  width: 0;\n  height: 0;\n  border-left: 18px solid white;\n  border-top: 12px solid transparent;\n  border-bottom: 12px solid transparent;\n}\n\n.video-wrapper iframe {\n  position: absolute;\n  top: 0;\n  left: 0;\n  width: 100%;\n  height: 100%;\n  border: none;\n  z-index: 4;\n}\n</style>\n\n<div class=\"video-wrapper youtube-spaced\" data-video-id=\"qCrIwry8zSI\">\n  <img\n    class=\"video-thumbnail\"\n    src=\"https://img.youtube.com/vi/qCrIwry8zSI/maxresdefault.jpg\"\n    onerror=\"this.onerror=null; this.src='https://img.youtube.com/vi/qCrIwry8zSI/0.jpg';\"\n    alt=\"YouTube Thumbnail\">\n    \n  \n\n  <div class=\"video-play-button\"></div>\n</div>\n\n<script>\ndocument.querySelectorAll('.video-wrapper').forEach(wrapper => {\n  if (wrapper.dataset.listenersAdded === 'true') {\n    return;\n  }\n  wrapper.dataset.listenersAdded = 'true';\n\n  const videoId = wrapper.dataset.videoId;\n  const overlay = wrapper.querySelector('.video-overlay');\n  const thumbnail = wrapper.querySelector('.video-thumbnail');\n\n  function loadVideo() {\n    wrapper.innerHTML = `<iframe src=\"https://www.youtube-nocookie.com/embed/${videoId}?autoplay=1&mute=1\" allowfullscreen></iframe>`;\n  }\n\n  wrapper.addEventListener('click', loadVideo);\n  overlay?.addEventListener('click', loadVideo);\n  thumbnail?.addEventListener('click', loadVideo);\n});\n</script>\n\n<p>whenever they want to cash in on growth or an industry or entertainment they can just run the metrics, spit out a result and then start engineering a solution to their needs. i&rsquo;ve seen it with the way they watch the android eco system and their own apps from makers that just take off and they just quietly fold into a new os version.</p>\n<p>how many times have you caught yourself saying, &ldquo;well that&rsquo;s _____ dead&rdquo; and they do this with the precision of a fleet of ninjas.  now it looks like they are folding both time and space to go after the kpop market.</p>\n<p>content on apple so far in the majority of things i have watched just does not miss. they have the tech, the hardware, the &ldquo;seo&rdquo; of every little tuned interaction.</p>\n<p>part of me winces in pain at the notion that that small open source developer with an idea got squeezed, probably got asked, but ultimately got rail roaded and flattened down like a jug handle town around route 66, just a blur in the distance from the new super highway.</p>\n<p>no time for reflection thou, this is just forward motion progress for right or wrong, no point allowing what went before in my generation and the legacy and lag of my opinions of the &ldquo;change&rdquo; &ndash; time is not waiting for anyone.</p>\n<p>get onboard the apple train, it&rsquo;s a freaking juggernaut.</p>\n",
				"content_text": "apple has all the data all the time.\n\n{{< yt \"qCrIwry8zSI\" >}}\n\nwhenever they want to cash in on growth or an industry or entertainment they can just run the metrics, spit out a result and then start engineering a solution to their needs. i've seen it with the way they watch the android eco system and their own apps from makers that just take off and they just quietly fold into a new os version.\n\nhow many times have you caught yourself saying, \"well that's _____ dead\" and they do this with the precision of a fleet of ninjas.  now it looks like they are folding both time and space to go after the kpop market.\n\ncontent on apple so far in the majority of things i have watched just does not miss. they have the tech, the hardware, the \"seo\" of every little tuned interaction.\n\npart of me winces in pain at the notion that that small open source developer with an idea got squeezed, probably got asked, but ultimately got rail roaded and flattened down like a jug handle town around route 66, just a blur in the distance from the new super highway.\n\nno time for reflection thou, this is just forward motion progress for right or wrong, no point allowing what went before in my generation and the legacy and lag of my opinions of the \"change\" -- time is not waiting for anyone.\n\nget onboard the apple train, it's a freaking juggernaut.\n",
				"date_published": "2025-08-01T11:16:11-04:00",
				"url": "https://sett.ee/2025/08/01/apple-laser-on-kpop.html",
				"tags": ["observations"]
			},
			{
				"id": "http://humble.micro.blog/2025/08/01/i-went-for-my-usual.html",
				"title": "generational music flow",
				"content_html": "<p>i went for my usual walk this morning; something felt different. Maybe it was the slipping into my generation&rsquo;s music which released something, but I ended up walking for double the amount of time. I was in a flow mental state. It&rsquo;s interesting how the generation you grew up in never truly lets go.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "i went for my usual walk this morning; something felt different. Maybe it was the slipping into my generation's music which released something, but I ended up walking for double the amount of time. I was in a flow mental state. It's interesting how the generation you grew up in never truly lets go.\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/bd8c332906.jpg\" alt=\"A morning walk accompanied by nostalgic music led to an extended, flow state experience.\">\n",
				"date_published": "2025-08-01T08:45:17-04:00",
				"url": "https://sett.ee/2025/08/01/i-went-for-my-usual.html",
				"tags": ["observations"]
			},
			{
				"id": "http://humble.micro.blog/2025/07/31/this-has-to-be-the.html",
				"title": "$200 to change your life?",
				"content_html": "<p>this has to be the best deal on the internet for $200 &ndash; <a href=\"https://lennysproductpass.com\">lennysproductpass.com</a> &ndash; i&rsquo;m not trying to promote it but damn, that&rsquo;s a first class ticket to empowerment for the next year of your life in this crazy ai world, absolute steal tbh. down with monthlies!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "this has to be the best deal on the internet for $200 -- [lennysproductpass.com](https://lennysproductpass.com) -- i'm not trying to promote it but damn, that's a first class ticket to empowerment for the next year of your life in this crazy ai world, absolute steal tbh. down with monthlies!\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/d6c34eddf6.webp\" alt=\"A promotional offer features a collection of tech product subscriptions, including Lovable, Replit, Bolt, n8n, Descript, and Warp, each with a brief description and pricing details.\">\n",
				"date_published": "2025-07-31T12:31:16-04:00",
				"url": "https://sett.ee/2025/07/31/this-has-to-be-the.html",
				"tags": ["purchases"]
			},
			{
				"id": "http://humble.micro.blog/2025/07/31/i-dunno-i-like-the.html",
				"title": "a blank slate",
				"content_html": "<p>i dunno, i like the slate tbh. i know it&rsquo;s gonna be basic af and stuff but that feels ok, like the rustic feel of wind your own windows and stuff, that&rsquo;s a pre-work out dude.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "i dunno, i like the slate tbh. i know it's gonna be basic af and stuff but that feels ok, like the rustic feel of wind your own windows and stuff, that's a pre-work out dude.\n\n<img src=\"https://humble.micro.blog/uploads/2025/image.png\" width=\"600\" height=\"340\" alt=\"\">\n",
				"date_published": "2025-07-31T12:24:15-04:00",
				"url": "https://sett.ee/2025/07/31/i-dunno-i-like-the.html"
			},
			{
				"id": "http://humble.micro.blog/2025/07/31/i-think-we-got-this.html",
				"title": "i think we got this.",
				"content_html": "<p>i&rsquo;m very excited for the near future, the next six months, just waiting on paperwork is so difficult when all you wanna do is go go go. i&rsquo;m utilizing this time however to get my &ldquo;ducks in a row&rdquo; for the things we want to do in the next few years. my wife did a presentation to me last night. onwards!</p>\n",
				"content_text": "i'm very excited for the near future, the next six months, just waiting on paperwork is so difficult when all you wanna do is go go go. i'm utilizing this time however to get my \"ducks in a row\" for the things we want to do in the next few years. my wife did a presentation to me last night. onwards!\n",
				"date_published": "2025-07-31T09:46:49-04:00",
				"url": "https://sett.ee/2025/07/31/i-think-we-got-this.html",
				"tags": ["observations"]
			},
			{
				"id": "http://humble.micro.blog/2025/07/30/trying-to-find-the-sweet.html",
				"title": "the heavens opened",
				"content_html": "<p>trying to find the sweet spot for images just compressing to 1200px right now while I work out page speed and load and everything else I’m sure this is just gonna be a feed interface to other platforms for me. also my daughter would love this.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "trying to find the sweet spot for images just compressing to 1200px right now while I work out page speed and load and everything else I’m sure this is just gonna be a feed interface to other platforms for me. also my daughter would love this.\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/ghibli.webp\" alt=\"A display in a store showcases various Studio Ghibli merchandise, including plush toys, puzzles, and figurines.\">\n",
				"date_published": "2025-07-30T22:18:55-04:00",
				"url": "https://sett.ee/2025/07/30/trying-to-find-the-sweet.html"
			},
			{
				"id": "http://humble.micro.blog/2025/07/30/dont-worry-lads-ive-moved.html",
				"title": "hearts in the chat",
				"content_html": "<p>don’t worry lads. I’ve moved into that period of my life where supplements and research has become a regular addition to my life. what you supplementing? Thoughts!? ;)</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "don’t worry lads. I’ve moved into that period of my life where supplements and research has become a regular addition to my life. what you supplementing? Thoughts!? ;)\n\n<img src=\"https://eu.uploads.micro.blog/244471/2025/cog10.webp\" alt=\"Bottles and boxes of Nature Made CoQ10 supplements are displayed on a store shelf.\">\n",
				"date_published": "2025-07-30T20:05:26-04:00",
				"url": "https://sett.ee/2025/07/30/dont-worry-lads-ive-moved.html",
				"tags": ["observations"]
			}
	]
}
